chenlongchoo/EM6300/Microchip/mTouchCap/PIC18F_PIC24F CTMU Library/mTouchCap_PIC18_CTMU_Physical.c
		Set_ScanTimer_IF_Bit_State(DISABLE);              //Clear timer 4 SHORT flag
		Set_ScanTimer_IE_Bit_State(DISABLE);              //Disable interrupt
		Set_ScanTimer_ON_Bit_State(DISABLE);              //Stop timer 4


		startupCount--;									  // Decrement 'n' times to establish startup


		for(Index=0; Index<ScanChannelIndex; Index++)	 
    	{
			averageData[ScanChannels[Index]] = curRawData[ScanChannels[Index]];	// During start up time, set Average each pass.
		}

		 
		Set_ScanTimer_IF_Bit_State(DISABLE);              //Clear flag
		Set_ScanTimer_IE_Bit_State(ENABLE);              //Enable interrupt
    	Set_ScanTimer_ON_Bit_State(ENABLE);              //Run timer
	}


}

/*********   	End of Function 	*********************/


/********************************************************************
 * Function		    :    void mTouchCapPhy_CTMUSetup(void)
 *
 * PreCondition	    :    None
 *
 * Input			:    None
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview		    : 	 This function will setup the CTMU control registers.
 *
 *
 * Note				: 	 Does the necessary CTMU setup. 
 *******************************************************************/

void mTouchCapPhy_CTMUSetup(void)
{


	Set_CTMU_ENABLE_Status(DISABLE);		//make sure CTMU is disabled 
	Idle_Mode_CTMU_Operation(DISABLE);		//CTMU continues to run in idle mode
	Set_CTMU_Time_Generation(DISABLE);		//disable edge delay generation mode of the CTMU
	Block_CTMU_Edge(DISABLE);				//edges are blocked
	Set_Edge_Sequence(DISABLE);				//edge sequence not needed
	Disable_CTMU_CurrentDischarge;	 		//Do not ground the current source
	Set_CTMU_Trigger_Control(DISABLE);		//Trigger Output is disabled
	Enable_CTMU_Negative_Edge2_Polarity;
	CTMU_Edge2_Source_Select(TRIGGER_SOURCE_EXTERNAL1);
	Enable_CTMU_Negative_Edge1_Polarity;
	CTMU_Edge1_Source_Select(TRIGGER_SOURCE_EXTERNAL1);
	

/***************************************************************************
--------------- Demo of API "mTouchCapAPI_CTMU_SetupCurrentSource" -----------------------		
		Setup the current source using the API "mTouchCapAPI_SetUpCTMU_Default". Pass the current source 
		range and Trim value as parameters.
***************************************************************************/
 
	mTouchCapAPI_CTMU_SetupCurrentSource(CURRENT_RANGE_BASE_CURRENT,0x00);

}




 /*********   	End of Function 	*********************/



/********************************************************************
 * Function			:    void mTouchCapPhy_ChannelSetup(WORD ChannelNum)
 *
 * PreCondition		:    None
 *
 * Input			:    ChannelNum
  							CHANNEL_AN0 ,
							CHANNEL_AN1 ,
							CHANNEL_AN2 ,
							CHANNEL_AN3 ,
							CHANNEL_AN4 ,
							CHANNEL_AN5 ,
							CHANNEL_AN6 ,
							CHANNEL_AN7 ,
							CHANNEL_AN8 ,
							CHANNEL_AN9 ,
							CHANNEL_AN10,
							CHANNEL_AN11,
							CHANNEL_AN12,
							CHANNEL_AN13,
							CHANNEL_AN14,
							CHANNEL_AN15,
							CHANNEL_AN16,
							CHANNEL_AN17,
							CHANNEL_AN18,
							CHANNEL_AN19,
							CHANNEL_AN20,
							CHANNEL_AN21,
							CHANNEL_AN22,
							CHANNEL_AN23,
							CHANNEL_AN24,
							CHANNEL_AN25,
							CHANNEL_AN26,
							CHANNEL_AN27,
							
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview			: 	 This function will setup the ADC channels that are used by the CTMU
 *				   		 Eval Board.
 *
 *
 * Note			:	Does the necessary CTMU port setup.
 *******************************************************************/


void mTouchCapPhy_ChannelSetup(WORD ChannelNum)
{
	#ifndef PIC18F_LOW_PIN_DEVICE
      
		#if defined ADC_ANCON_LEGACY || defined ADC_ANSEL_NEW ||  defined ADC_ANCON_NEW 
			//The controllers which has common type of Analog channel selection are grouped 																					
	        // Make sure that only selected channel is made input while the other port pins remain configured as output.
	        // configure the port pins of the respective channels as input and as Analog
	        // Update the current channel number which has to be processed by the ADC
	        // configurations for the Channel 0 as default
		    switch (ChannelNum)
			{
		
				case CHANNEL_AN0:
		            TRIS_CHANNEL_AN0 = INPUT;               //make the channel 0 as input based on the Index
					ADC_CHANNEL_AN0(ANALOG);
		                      
		        break;
		
				case CHANNEL_AN1:
		            TRIS_CHANNEL_AN1 = INPUT;               //make the channel 1 as input based on the Index
					ADC_CHANNEL_AN1(ANALOG);
				break;
		
				case CHANNEL_AN2:
		            TRIS_CHANNEL_AN2 = INPUT;               //make the channel 2 as input based on the Index
					ADC_CHANNEL_AN2(ANALOG);
		 		break;
		
				case CHANNEL_AN3:
		            TRIS_CHANNEL_AN3 = INPUT;               //make the channel 3 as input based on the Index
					ADC_CHANNEL_AN3(ANALOG);
				break;
		
				case CHANNEL_AN4:
		            TRIS_CHANNEL_AN4 = INPUT;               //make the channel 4 as input based on the Index
					ADC_CHANNEL_AN4(ANALOG);
				break;
		
				case CHANNEL_AN5:
		            TRIS_CHANNEL_AN5 = INPUT;               //make the channel 5 as input based on the Index
					ADC_CHANNEL_AN5(ANALOG);
				break;
		
				case CHANNEL_AN6:
		            TRIS_CHANNEL_AN6 = INPUT;               //make the channel 6 as input based on the Index
					ADC_CHANNEL_AN6(ANALOG);
				break;
		
				case CHANNEL_AN7:
		            TRIS_CHANNEL_AN7 = INPUT;               //make the channel 7 as input based on the Index
					ADC_CHANNEL_AN7(ANALOG);
				break;
		
				case CHANNEL_AN8:
		            TRIS_CHANNEL_AN8 = INPUT;               //make the channel 8 as input based on the Index
					ADC_CHANNEL_AN8(ANALOG);
				break;
		
				case CHANNEL_AN9:
		            TRIS_CHANNEL_AN9 = INPUT;               //make the channel 9 as input based on the Index
					ADC_CHANNEL_AN9(ANALOG);
				break;	
				
				case CHANNEL_AN10:
		            TRIS_CHANNEL_AN1O = INPUT;               //make the channel 10 as input based on the Index
					ADC_CHANNEL_AN10(ANALOG);
				break;
		
				case CHANNEL_AN11:
		            TRIS_CHANNEL_AN11 = INPUT;               //make the channel 11 as input based on the Index
					ADC_CHANNEL_AN11(ANALOG);
		 		break;
		
				case CHANNEL_AN12:
		            TRIS_CHANNEL_AN12 = INPUT;               //make the channel 12 as input based on the Index
					ADC_CHANNEL_AN12(ANALOG);
		 		break;
	
				#if defined(ADC_ANSEL_NEW) || defined(ADC_ANCON_NEW)	//Configure remaining channels as also Analog for controllers defined under this MACROs
		
					case CHANNEL_AN13:
			            TRIS_CHANNEL_AN13 = INPUT;               //make the channel 13 as input based on the Index
						ADC_CHANNEL_AN13(ANALOG);
			 		break;
			
