chenlongchoo/EM6300/Microchip/mTouchCap/PIC18F_PIC24F CTMU Library/mTouchCap_PIC18_CTMU_Physical.c
					case CHANNEL_AN14:
			            TRIS_CHANNEL_AN14 = INPUT;               //make the channel 14 as input based on the Index
						ADC_CHANNEL_AN14(ANALOG);
					break;
			
					case CHANNEL_AN15:
			            TRIS_CHANNEL_AN15 = INPUT;               //make the channel 15 as input based on the Index
						ADC_CHANNEL_AN15(ANALOG);
					break;
			
					#ifndef _18F6XK22							//Configure 15 channels as Analog and skip all other. Since this series controllers have 15 Analog channel				
		
						case CHANNEL_AN16:
				            TRIS_CHANNEL_AN16 = INPUT;               //make the channel 16 as input based on the Index
							ADC_CHANNEL_AN16(ANALOG);
						break;
				
						case CHANNEL_AN17:
				            TRIS_CHANNEL_AN17 = INPUT;               //make the channel 17 as input based on the Index
							ADC_CHANNEL_AN17(ANALOG);
						break;
				
						case CHANNEL_AN18:
				            TRIS_CHANNEL_AN18 = INPUT;               //make the channel 18 as input based on the Index
							ADC_CHANNEL_AN18(ANALOG);
				 		break;
				
						case CHANNEL_AN19:
				            TRIS_CHANNEL_AN19 = INPUT;               //make the channel 19 as input based on the Index
							ADC_CHANNEL_AN19(ANALOG);
				 		break;
			
						case CHANNEL_AN20:
				            TRIS_CHANNEL_AN20 = INPUT;               //make the channel 20 as input based on the Index
							ADC_CHANNEL_AN20(ANALOG);
						break;
				
						case CHANNEL_AN21:
				            TRIS_CHANNEL_AN21 = INPUT;               //make the channel 21 as input based on the Index
							ADC_CHANNEL_AN21(ANALOG);
						break;
				
						case CHANNEL_AN22:
				            TRIS_CHANNEL_AN22 = INPUT;               //make the channel 22 as input based on the Index
							ADC_CHANNEL_AN22(ANALOG);
						break;
				
						case CHANNEL_AN23:
				            TRIS_CHANNEL_AN23 = INPUT;               //make the channel 23 as input based on the Index
							ADC_CHANNEL_AN23(ANALOG);
						break;
					
					#endif
				#endif
					#ifdef ADC_ANSEL_NEW								//Configure remaining channels as also Analog for controllers defined under this MACROs
	
						case CHANNEL_AN24:
				            TRIS_CHANNEL_AN24 = INPUT;               //make the channel 24 as input based on the Index
							ADC_CHANNEL_AN24(ANALOG);
						break;
				
						#ifndef _18XF2XK22								//Configure 15 channels as Analog and skip all other. Since this series controllers have 24 Analog channel
							case CHANNEL_AN25:
					            TRIS_CHANNEL_AN25 = INPUT;               //make the channel 25 as input based on the Index
								ADC_CHANNEL_AN25(ANALOG);
							break;
					
							case CHANNEL_AN26:
					            TRIS_CHANNEL_AN26 = INPUT;               //make the channel 26 as input based on the Index
								ADC_CHANNEL_AN26(ANALOG);
							break;
					
							case CHANNEL_AN27:
					            TRIS_CHANNEL_AN27 = INPUT;               //make the channel 27 as input based on the Index
								ADC_CHANNEL_AN27(ANALOG);
							break;
						#endif
	
					#endif
			//	#endif
			
				default:
		            TRIS_CHANNEL_AN0 = INPUT;               //make the channel 0 as input based on the Index
					ADC_CHANNEL_AN0(ANALOG);
		 		break;
	
			} 
				/* Connect the selected channel to ADC MUX */
	         	//load the channel number that has to be read
	       		 mTouchCapADC_SetChannelADC(ChannelNum);
					 
	
		#elif defined ADC_ADCON_LEGACY					//To configure port pin has Analog, combination of register value should be considered in the controllers defined
															//under these. 
			switch (ChannelNum)
			{
		
				case CHANNEL_AN0:
			          TRIS_CHANNEL_AN0 = INPUT;               //make the channel 0 as input based on the Index
					  ADC_COMBINE_CHANNEL(ADC_AN0);
			                      
			    break;
			
				case CHANNEL_AN1:
			    	TRIS_CHANNEL_AN1 = INPUT;               //make the channel 1 as input based on the Index
					ADC_COMBINE_CHANNEL(ADC_AN1);
				break;
			
				case CHANNEL_AN2:
			    	TRIS_CHANNEL_AN2 = INPUT;               //make the channel 2 as input based on the Index
					ADC_COMBINE_CHANNEL(ADC_AN2);
			 	break;
			
				case CHANNEL_AN3:
			        TRIS_CHANNEL_AN3 = INPUT;               //make the channel 3 as input based on the Index
					ADC_COMBINE_CHANNEL(ADC_AN3);
				break;
			
				case CHANNEL_AN4:
			        TRIS_CHANNEL_AN4 = INPUT;               //make the channel 4 as input based on the Index
					ADC_COMBINE_CHANNEL(ADC_AN4);
				break;
			
				case CHANNEL_AN5:
			        TRIS_CHANNEL_AN5 = INPUT;               //make the channel 5 as input based on the Index
					ADC_COMBINE_CHANNEL(ADC_AN5);
				break;
			
				case CHANNEL_AN6:
			        TRIS_CHANNEL_AN6 = INPUT;               //make the channel 6 as input based on the Index
					ADC_COMBINE_CHANNEL(ADC_AN6);
				break;
			
				case CHANNEL_AN7:
			        TRIS_CHANNEL_AN7 = INPUT;               //make the channel 7 as input based on the Index
					ADC_COMBINE_CHANNEL(ADC_AN7);
				break;
			
				case CHANNEL_AN8:
			        TRIS_CHANNEL_AN8 = INPUT;               //make the channel 8 as input based on the Index
					ADC_COMBINE_CHANNEL(ADC_AN8);
				break;
			
				case CHANNEL_AN9:
			        TRIS_CHANNEL_AN9 = INPUT;               //make the channel 9 as input based on the Index
					ADC_COMBINE_CHANNEL(ADC_AN9);
				break;
			
				case CHANNEL_AN10:
			        TRIS_CHANNEL_AN1O = INPUT;               //make the channel 10 as input based on the Index
					ADC_COMBINE_CHANNEL(ADC_AN10);
				break;
			
				case CHANNEL_AN11:
			        TRIS_CHANNEL_AN11 = INPUT;               //make the channel 11 as input based on the Index
					ADC_COMBINE_CHANNEL(ADC_AN11);
			 	break;	
			
				default:
			        TRIS_CHANNEL_AN0 = INPUT;               //make the channel 0 as input based on the Index
					ADC_COMBINE_CHANNEL(ADC_AN0);
			 	break;
		
			}
		 		 /* Connect the selected channel to ADC MUX */
	         	//load the channel number that has to be read
	       		 mTouchCapADC_SetChannelADC(ChannelNum);
	
		#endif
	#endif
}



 /*********   	End of Function 	*********************/

 

